



#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	ОбщегоНазначенияУТКлиент.Записать(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	ОбщегоНазначенияУТКлиент.Провести(ЭтотОбъект);
КонецПроцедуры




&НаСервереБезКонтекста
Функция ПолучитьЧислоНДССервер(СтавкаНДССсылка, Сумма, Включен=Истина)
	Результат = 0;
	Ставка = СтавкаНДССсылка.Ставка;
	Если Ставка<>0 Тогда	
		Коэф = Ставка/100;
		Если Включен Тогда
			//итог = сумма*1,2;
			//сумма=;
			//ндс= итог/1,2*0,2;
			Результат = Окр(Сумма/(1+Коэф)*Коэф,2,РежимОкругления.Окр15как20);
		Иначе
			Результат = Окр(Сумма*Коэф,2,РежимОкругления.Окр15как20);
		КонецЕсли;	
	КонецЕсли; 
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ТоварыКолВоЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	КолВо = ?(ТекДанные.КоличествоУпаковок=0,1,ТекДанные.КоличествоУпаковок);
	ТекДанные.Сумма = Окр(КолВо*ТекДанные.Цена,2,РежимОкругления.Окр15как10);
	
	ПересчитатНДС(ТекДанные);
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатНДС(ТекДанные)
	ТекДанные.СуммаНДС = ПолучитьЧислоНДССервер(ТекДанные.СтавкаНДС, ТекДанные.Сумма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПересчитатНДС(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокутмен2НаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ОбменДанными.Загрузка = истина;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
КонецПроцедуры



&НаКлиенте
Процедура ЗаписатьДокутмен2(Команда)
	ЗаписатьДокутмен2НаСервере();
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры
#КонецОбласти


